## Rule-Based Salary Simulation Using SQL Window Functions

This notebook simulates salary increments based on department averages
to analyze financial impact before applying real changes.

Technologies:
- MySQL
- SQL Window Functions
- Python (Pandas, SQLAlchemy)
- Jupyter Notebook

In [40]:
!pip install pandas sqlalchemy pymysql ipython-sql

Requirement already satisfied: pandas in /Library/Frameworks/Python.framework/Versions/3.14/lib/python3.14/site-packages (2.3.3)
Requirement already satisfied: sqlalchemy in /Library/Frameworks/Python.framework/Versions/3.14/lib/python3.14/site-packages (2.0.45)
Requirement already satisfied: pymysql in /Library/Frameworks/Python.framework/Versions/3.14/lib/python3.14/site-packages (1.1.2)
Requirement already satisfied: ipython-sql in /Library/Frameworks/Python.framework/Versions/3.14/lib/python3.14/site-packages (0.5.0)
Requirement already satisfied: numpy>=1.26.0 in /Library/Frameworks/Python.framework/Versions/3.14/lib/python3.14/site-packages (from pandas) (2.3.5)
Requirement already satisfied: python-dateutil>=2.8.2 in /Library/Frameworks/Python.framework/Versions/3.14/lib/python3.14/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /Library/Frameworks/Python.framework/Versions/3.14/lib/python3.14/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in /Library/Frameworks/Python.framework/Versions/3.14/lib/python3.14/site-packages (from pandas) (2025.3)
Requirement already satisfied: typing-extensions>=4.6.0 in /Library/Frameworks/Python.framework/Versions/3.14/lib/python3.14/site-packages (from sqlalchemy) (4.15.0)
Requirement already satisfied: prettytable in /Library/Frameworks/Python.framework/Versions/3.14/lib/python3.14/site-packages (from ipython-sql) (3.17.0)
Requirement already satisfied: ipython in /Library/Frameworks/Python.framework/Versions/3.14/lib/python3.14/site-packages (from ipython-sql) (9.8.0)
Requirement already satisfied: sqlparse in /Library/Frameworks/Python.framework/Versions/3.14/lib/python3.14/site-packages (from ipython-sql) (0.5.5)
Requirement already satisfied: six in /Library/Frameworks/Python.framework/Versions/3.14/lib/python3.14/site-packages (from ipython-sql) (1.17.0)
Requirement already satisfied: ipython-genutils in /Library/Frameworks/Python.framework/Versions/3.14/lib/python3.14/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: decorator>=4.3.2 in /Library/Frameworks/Python.framework/Versions/3.14/lib/python3.14/site-packages (from ipython->ipython-sql) (5.2.1)
Requirement already satisfied: ipython-pygments-lexers>=1.0.0 in /Library/Frameworks/Python.framework/Versions/3.14/lib/python3.14/site-packages (from ipython->ipython-sql) (1.1.1)
Requirement already satisfied: jedi>=0.18.1 in /Library/Frameworks/Python.framework/Versions/3.14/lib/python3.14/site-packages (from ipython->ipython-sql) (0.19.2)
Requirement already satisfied: matplotlib-inline>=0.1.5 in /Library/Frameworks/Python.framework/Versions/3.14/lib/python3.14/site-packages (from ipython->ipython-sql) (0.2.1)
Requirement already satisfied: pexpect>4.3 in /Library/Frameworks/Python.framework/Versions/3.14/lib/python3.14/site-packages (from ipython->ipython-sql) (4.9.0)
Requirement already satisfied: prompt_toolkit<3.1.0,>=3.0.41 in /Library/Frameworks/Python.framework/Versions/3.14/lib/python3.14/site-packages (from ipython->ipython-sql) (3.0.52)
Requirement already satisfied: pygments>=2.11.0 in /Library/Frameworks/Python.framework/Versions/3.14/lib/python3.14/site-packages (from ipython->ipython-sql) (2.19.2)
Requirement already satisfied: stack_data>=0.6.0 in /Library/Frameworks/Python.framework/Versions/3.14/lib/python3.14/site-packages (from ipython->ipython-sql) (0.6.3)
Requirement already satisfied: traitlets>=5.13.0 in /Library/Frameworks/Python.framework/Versions/3.14/lib/python3.14/site-packages (from ipython->ipython-sql) (5.14.3)
Requirement already satisfied: wcwidth in /Library/Frameworks/Python.framework/Versions/3.14/lib/python3.14/site-packages (from prompt_toolkit<3.1.0,>=3.0.41->ipython->ipython-sql) (0.2.14)
Requirement already satisfied: parso<0.9.0,>=0.8.4 in /Library/Frameworks/Python.framework/Versions/3.14/lib/python3.14/site-packages (from jedi>=0.18.1->ipython->ipython-sql) (0.8.5)
Requirement already satisfied: ptyprocess>=0.5 in /Library/Frameworks/Python.framework/Versions/3.14/lib/python3.14/site-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Requirement already satisfied: executing>=1.2.0 in /Library/Frameworks/Python.framework/Versions/3.14/lib/python3.14/site-packages (from stack_data>=0.6.0->ipython->ipython-sql) (2.2.1)
Requirement already satisfied: asttokens>=2.1.0 in /Library/Frameworks/Python.framework/Versions/3.14/lib/python3.14/site-packages (from stack_data>=0.6.0->ipython->ipython-sql) (3.0.1)
Requirement already satisfied: pure-eval in /Library/Frameworks/Python.framework/Versions/3.14/lib/python3.14/site-packages (from stack_data>=0.6.0->ipython->ipython-sql) (0.2.3)

# NOTE: Database credentials have been removed for security.
# Update your local connection details before running.

In [ ]:
from sqlalchemy import create_engine, text

engine0 = create_engine("mysql+pymysql://root:password@localhost:3306/")

with engine0.connect() as conn:
    conn.execute(text("CREATE DATABASE IF NOT EXISTS hr_db;"))

In [ ]:
engine = create_engine(
    "mysql+pymysql://root:password@localhost:3306/hr_db"
)

In [43]:
import pandas as pd

df = pd.read_csv("/Users/dineshkumarmuthusamy/Desktop/Salary_analysis/employees.csv")
df.head()

   employee_id employee_name department  salary
0            1         Alice         IT   72000
1            2           Ben         IT   85000
2            3       Charlie         IT   98000
3            4         Deepa         IT   64000
4            5         Ethan         IT  110000

In [44]:
df.to_sql("employees", engine, if_exists="replace", index=False)

40

In [45]:
pd.read_sql("SELECT * FROM employees LIMIT 5;", engine)

   employee_id employee_name department  salary
0            1         Alice         IT   72000
1            2           Ben         IT   85000
2            3       Charlie         IT   98000
3            4         Deepa         IT   64000
4            5         Ethan         IT  110000

In [46]:
%load_ext sql
%sql mysql+pymysql://root:root1234@localhost:3306/hr_db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [47]:
%%sql
WITH classified AS (
    SELECT
        employee_id,
        employee_name,
        department,
        salary AS old_salary,
        AVG(salary) OVER (PARTITION BY department) AS dept_avg_salary
    FROM employees
),
simulated AS (
    SELECT
        *,
        CASE
            WHEN old_salary < dept_avg_salary * 0.9 THEN 'Low'
            WHEN old_salary > dept_avg_salary * 1.1 THEN 'High'
            ELSE 'Mid'
        END AS dept_position,
        ROUND(
            CASE
                WHEN old_salary < dept_avg_salary * 0.9 THEN old_salary * 1.10
                WHEN old_salary > dept_avg_salary * 1.1 THEN old_salary
                ELSE old_salary * 1.05
            END, 2
        ) AS new_salary
    FROM classified
),
dept_totals AS (
    SELECT
        department,
        SUM(old_salary) AS dept_old_total,
        SUM(new_salary) AS dept_new_total
    FROM simulated
    GROUP BY department
)
SELECT
    s.employee_id,
    s.employee_name,
    s.department,
    s.old_salary,
    ROUND(s.dept_avg_salary,2) AS dept_avg_salary,
    s.dept_position,
    s.new_salary,
    ROUND(s.new_salary - s.old_salary,2) AS individual_increase,
    d.dept_old_total,
    d.dept_new_total,
    ROUND(d.dept_new_total - d.dept_old_total,2) AS dept_increase
FROM simulated s
JOIN dept_totals d
ON s.department = d.department
ORDER BY s.department, s.employee_id;

 * mysql+pymysql://root:***@localhost:3306/hr_db
40 rows affected.

[(19, 'Sam', 'Finance', 70000, Decimal('82857.14'), 'Low', Decimal('77000.00'), Decimal('7000.00'), Decimal('580000'), Decimal('606100.00'), Decimal('26100.00')),
 (20, 'Tara', 'Finance', 88000, Decimal('82857.14'), 'Mid', Decimal('92400.00'), Decimal('4400.00'), Decimal('580000'), Decimal('606100.00'), Decimal('26100.00')),
 (21, 'Umar', 'Finance', 102000, Decimal('82857.14'), 'High', Decimal('102000.00'), Decimal('0.00'), Decimal('580000'), Decimal('606100.00'), Decimal('26100.00')),
 (22, 'Val', 'Finance', 76000, Decimal('82857.14'), 'Mid', Decimal('79800.00'), Decimal('3800.00'), Decimal('580000'), Decimal('606100.00'), Decimal('26100.00')),
 (23, 'Wen', 'Finance', 94000, Decimal('82857.14'), 'High', Decimal('94000.00'), Decimal('0.00'), Decimal('580000'), Decimal('606100.00'), Decimal('26100.00')),
 (24, 'Yara', 'Finance', 68000, Decimal('82857.14'), 'Low', Decimal('74800.00'), Decimal('6800.00'), Decimal('580000'), Decimal('606100.00'), Decimal('26100.00')),
 (39, 'Noah', 'Finance', 82000, Decimal('82857.14'), 'Mid', Decimal('86100.00'), Decimal('4100.00'), Decimal('580000'), Decimal('606100.00'), Decimal('26100.00')),
 (13, 'Mason', 'HR', 48000, Decimal('54833.33'), 'Low', Decimal('52800.00'), Decimal('4800.00'), Decimal('329000'), Decimal('343800.00'), Decimal('14800.00')),
 (14, 'Nina', 'HR', 53000, Decimal('54833.33'), 'Mid', Decimal('55650.00'), Decimal('2650.00'), Decimal('329000'), Decimal('343800.00'), Decimal('14800.00')),
 (15, 'Omar', 'HR', 61000, Decimal('54833.33'), 'High', Decimal('61000.00'), Decimal('0.00'), Decimal('329000'), Decimal('343800.00'), Decimal('14800.00')),
 (16, 'Priya', 'HR', 57000, Decimal('54833.33'), 'Mid', Decimal('59850.00'), Decimal('2850.00'), Decimal('329000'), Decimal('343800.00'), Decimal('14800.00')),
 (17, 'Quinn', 'HR', 45000, Decimal('54833.33'), 'Low', Decimal('49500.00'), Decimal('4500.00'), Decimal('329000'), Decimal('343800.00'), Decimal('14800.00')),
 (18, 'Rosa', 'HR', 65000, Decimal('54833.33'), 'High', Decimal('65000.00'), Decimal('0.00'), Decimal('329000'), Decimal('343800.00'), Decimal('14800.00')),
 (1, 'Alice', 'IT', 72000, Decimal('85000.00'), 'Low', Decimal('79200.00'), Decimal('7200.00'), Decimal('595000'), Decimal('624950.00'), Decimal('29950.00')),
 (2, 'Ben', 'IT', 85000, Decimal('85000.00'), 'Mid', Decimal('89250.00'), Decimal('4250.00'), Decimal('595000'), Decimal('624950.00'), Decimal('29950.00')),
 (3, 'Charlie', 'IT', 98000, Decimal('85000.00'), 'High', Decimal('98000.00'), Decimal('0.00'), Decimal('595000'), Decimal('624950.00'), Decimal('29950.00')),
 (4, 'Deepa', 'IT', 64000, Decimal('85000.00'), 'Low', Decimal('70400.00'), Decimal('6400.00'), Decimal('595000'), Decimal('624950.00'), Decimal('29950.00')),
 (5, 'Ethan', 'IT', 110000, Decimal('85000.00'), 'High', Decimal('110000.00'), Decimal('0.00'), Decimal('595000'), Decimal('624950.00'), Decimal('29950.00')),
 (6, 'Fatima', 'IT', 90000, Decimal('85000.00'), 'Mid', Decimal('94500.00'), Decimal('4500.00'), Decimal('595000'), Decimal('624950.00'), Decimal('29950.00')),
 (37, 'Liam', 'IT', 76000, Decimal('85000.00'), 'Low', Decimal('83600.00'), Decimal('7600.00'), Decimal('595000'), Decimal('624950.00'), Decimal('29950.00')),
 (31, 'Felix', 'Marketing', 54000, Decimal('65666.67'), 'Low', Decimal('59400.00'), Decimal('5400.00'), Decimal('394000'), Decimal('415100.00'), Decimal('21100.00')),
 (32, 'Gia', 'Marketing', 60000, Decimal('65666.67'), 'Mid', Decimal('63000.00'), Decimal('3000.00'), Decimal('394000'), Decimal('415100.00'), Decimal('21100.00')),
 (33, 'Hector', 'Marketing', 72000, Decimal('65666.67'), 'Mid', Decimal('75600.00'), Decimal('3600.00'), Decimal('394000'), Decimal('415100.00'), Decimal('21100.00')),
 (34, 'Ivy', 'Marketing', 68000, Decimal('65666.67'), 'Mid', Decimal('71400.00'), Decimal('3400.00'), Decimal('394000'), Decimal('415100.00'), Decimal('21100.00')),
 (35, 'Jamal', 'Marketing', 83000, Decimal('65666.67'), 'High', Decimal('83000.00'), Decimal('0.00'), Decimal('394000'), Decimal('415100.00'), Decimal('21100.00')),
 (36, 'Kiran', 'Marketing', 57000, Decimal('65666.67'), 'Low', Decimal('62700.00'), Decimal('5700.00'), Decimal('394000'), Decimal('415100.00'), Decimal('21100.00')),
 (25, 'Zack', 'Ops', 46000, Decimal('56285.71'), 'Low', Decimal('50600.00'), Decimal('4600.00'), Decimal('394000'), Decimal('411700.00'), Decimal('17700.00')),
 (26, 'Asha', 'Ops', 52000, Decimal('56285.71'), 'Mid', Decimal('54600.00'), Decimal('2600.00'), Decimal('394000'), Decimal('411700.00'), Decimal('17700.00')),
 (27, 'Bryan', 'Ops', 59000, Decimal('56285.71'), 'Mid', Decimal('61950.00'), Decimal('2950.00'), Decimal('394000'), Decimal('411700.00'), Decimal('17700.00')),
 (28, 'Camila', 'Ops', 63000, Decimal('56285.71'), 'High', Decimal('63000.00'), Decimal('0.00'), Decimal('394000'), Decimal('411700.00'), Decimal('17700.00')),
 (29, 'Dylan', 'Ops', 55000, Decimal('56285.71'), 'Mid', Decimal('57750.00'), Decimal('2750.00'), Decimal('394000'), Decimal('411700.00'), Decimal('17700.00')),
 (30, 'Eva', 'Ops', 71000, Decimal('56285.71'), 'High', Decimal('71000.00'), Decimal('0.00'), Decimal('394000'), Decimal('411700.00'), Decimal('17700.00')),
 (40, 'Olivia', 'Ops', 48000, Decimal('56285.71'), 'Low', Decimal('52800.00'), Decimal('4800.00'), Decimal('394000'), Decimal('411700.00'), Decimal('17700.00')),
 (7, 'George', 'Sales', 52000, Decimal('65571.43'), 'Low', Decimal('57200.00'), Decimal('5200.00'), Decimal('459000'), Decimal('479500.00'), Decimal('20500.00')),
 (8, 'Hana', 'Sales', 61000, Decimal('65571.43'), 'Mid', Decimal('64050.00'), Decimal('3050.00'), Decimal('459000'), Decimal('479500.00'), Decimal('20500.00')),
 (9, 'Ibrahim', 'Sales', 75000, Decimal('65571.43'), 'High', Decimal('75000.00'), Decimal('0.00'), Decimal('459000'), Decimal('479500.00'), Decimal('20500.00')),
 (10, 'Julia', 'Sales', 69000, Decimal('65571.43'), 'Mid', Decimal('72450.00'), Decimal('3450.00'), Decimal('459000'), Decimal('479500.00'), Decimal('20500.00')),
 (11, 'Kai', 'Sales', 82000, Decimal('65571.43'), 'High', Decimal('82000.00'), Decimal('0.00'), Decimal('459000'), Decimal('479500.00'), Decimal('20500.00')),
 (12, 'Laila', 'Sales', 56000, Decimal('65571.43'), 'Low', Decimal('61600.00'), Decimal('5600.00'), Decimal('459000'), Decimal('479500.00'), Decimal('20500.00')),
 (38, 'Mia', 'Sales', 64000, Decimal('65571.43'), 'Mid', Decimal('67200.00'), Decimal('3200.00'), Decimal('459000'), Decimal('479500.00'), Decimal('20500.00'))]

In [48]:
%%sql
SELECT * FROM employees;

 * mysql+pymysql://root:***@localhost:3306/hr_db
40 rows affected.

[(1, 'Alice', 'IT', 72000),
 (2, 'Ben', 'IT', 85000),
 (3, 'Charlie', 'IT', 98000),
 (4, 'Deepa', 'IT', 64000),
 (5, 'Ethan', 'IT', 110000),
 (6, 'Fatima', 'IT', 90000),
 (7, 'George', 'Sales', 52000),
 (8, 'Hana', 'Sales', 61000),
 (9, 'Ibrahim', 'Sales', 75000),
 (10, 'Julia', 'Sales', 69000),
 (11, 'Kai', 'Sales', 82000),
 (12, 'Laila', 'Sales', 56000),
 (13, 'Mason', 'HR', 48000),
 (14, 'Nina', 'HR', 53000),
 (15, 'Omar', 'HR', 61000),
 (16, 'Priya', 'HR', 57000),
 (17, 'Quinn', 'HR', 45000),
 (18, 'Rosa', 'HR', 65000),
 (19, 'Sam', 'Finance', 70000),
 (20, 'Tara', 'Finance', 88000),
 (21, 'Umar', 'Finance', 102000),
 (22, 'Val', 'Finance', 76000),
 (23, 'Wen', 'Finance', 94000),
 (24, 'Yara', 'Finance', 68000),
 (25, 'Zack', 'Ops', 46000),
 (26, 'Asha', 'Ops', 52000),
 (27, 'Bryan', 'Ops', 59000),
 (28, 'Camila', 'Ops', 63000),
 (29, 'Dylan', 'Ops', 55000),
 (30, 'Eva', 'Ops', 71000),
 (31, 'Felix', 'Marketing', 54000),
 (32, 'Gia', 'Marketing', 60000),
 (33, 'Hector', 'Marketing', 72000),
 (34, 'Ivy', 'Marketing', 68000),
 (35, 'Jamal', 'Marketing', 83000),
 (36, 'Kiran', 'Marketing', 57000),
 (37, 'Liam', 'IT', 76000),
 (38, 'Mia', 'Sales', 64000),
 (39, 'Noah', 'Finance', 82000),
 (40, 'Olivia', 'Ops', 48000)]

In [49]:
df_output = _.DataFrame()
df_output.to_csv("salary_simulation_output.csv", index=False)

In [51]:
from IPython.display import FileLink

FileLink("salary_simulation_output.csv")

/Users/dineshkumarmuthusamy/Desktop/Salary_analysis/salary_simulation_output.csv